name: "TimelineNet"
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "/var/lib/data/timeline/pettorine_dataset/temp/file_listTEST.txt"
    mean_file: "/home/claudia/caffe/networks/timeline_softmax_loss/timeline_mean.binaryproto"
    batch_size: 100
  }
}
layers {
  name: "h2"
  type: CONVOLUTION
  bottom: "data"
  top: "h2"
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 2
    weight_filler { 
      type: "uniform"
      min: -0.05
      max: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "h3"
  type: CONVOLUTION
  bottom: "h2"
  top: "h3"
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 2
    weight_filler { 
      type: "uniform"
      min: -0.05
      max: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "h3"
  bottom: "label"
  top: "accuracy"
}
layers {
  name: "prob"
  type: SOFTMAX_LOSS
  bottom: "h2"
  bottom: "label"
}
