name: "TimelineNet"
layers {
  name: "mnist"
  type: DATA
  top: "data"
  top: "label"
  data_param {
    source: /home/ladydisaster/libs/caffe/caffe/examples/mnist/mnist-train-leveldb" #PER IL MOMENTO LO PROVIAMO COSÌ POI METTIAMO LE NOSTRE IMMAGINI
    scale: 0.00390625
    batch_size: 64
    channels: 1 #SI PUÒ METTERE?
    new_height: 28 #45
    new_width: 28 #32
  }
}
layers {
  name: "h2"
  type: CONVOLUTION
  bottom: "data"
  top: "h2"
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 2
    weight_filler { 
      type: "uniform"
      min: -0.05
      max: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "pool1"
  type: POOLING
  pooling_param {
    kernel_size: 4
    stride: 2
    pool: MAX
  }
  bottom: "h2"
  top: "pool1"
}
layers {
  name: "h3"
  type: CONVOLUTION
  bottom: "h2"
  top: "h3"
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 2
    weight_filler { 
      type: "uniform"
      min: -0.05
      max: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "pool2"
  type: POOLING
  pooling_param {
    kernel_size: 4
    stride: 2
    pool: MAX
  }
  bottom: "h3"
  top: "pool2"
}
layers {
  name: "y"
  type: SIGMOID
  num_output: 46 #si potrà mettere?
  bottom: "h3"
  top: "output"
}
